import { defineStore } from 'pinia';

export const useFaqStore = defineStore('faqStore', {
  state: () => ({
    activeIndex: 0, 
    faqs: [
      {
        question: 'តើខ្ញុំអាចកម្មង់គ្រឿងផ្សំ បន្លែ និងផ្លែឈើប្រភេទអ្វីខ្លះ?',
        answer: 'អ្នកអាចកម្មង់បន្លែ ផ្លែឈើ និងគ្រឿងផ្សំធ្វើម្ហូបដែលថ្មីស្រស់ ជាមួយនឹងផលិតផលអ័រហ្គានិក និងផលិតផលតាមរដូវកាល។',
      },
      {
        question: 'តើសេវាកម្មដឹកជញ្ជូនដំណើរការយ៉ាងដូចម្តេច?',
        answer: 'បន្ទាប់ពីអ្នកបានកម្មង់យើងនឹងរៀបចំពេលវេលា និងចែកចាយអាសយដ្ឋានដែលអ្នកបានបញ្ជាក់។',
      },
      {
        question: 'តើមានចំនួនបញ្ជាទិញអប្បបរមាសម្រាប់ការដឹកជញ្ជូនឬទេ?',
        answer: 'មាន! យើងអាចមានចំនួនកម្មង់អប្បបរមាដែលអាស្រ័យលើទីតាំងរបស់អ្នក។',
      },
      {
        question: 'តើអ្នកទទួលការបង់ប្រាក់បែបណាខ្លះ?',
        answer: 'យើងទទួលការបង់ប្រាក់តាម ABA និងការបង់សាច់ប្រាក់នៅពេលដឹកជញ្ជូន។',
      },
      {
        question: 'តើអ្នកអាចធ្វើការកម្មង់អីវ៉ាន់ផ្សេងគ្នាក្នុងពេលតែមួយបានដែរឬទេ?',
        answer: 'យើងទទួលការបង់ប្រាក់តាម ABA និងការបង់សាច់ប្រាក់នៅពេលដឹកជញ្ជូន។',
      }
      ,
      
    ]
  }),
  actions: {
    toggle(index) {
      this.activeIndex = this.activeIndex === index ? null : index;
    }
  }
});
